Repository: nazrdogan/IDE_translations
Catalog: Resources_*.po
Languages: tr

source: Settings issues
tr: Ayarlarla ilgili sorunlar

source: Arduino cannot run because it could not create a folder to store your settings.
tr: Arduino yürütülemedi çünkü ayarlarýný saklamak için klasör oluþturulamadý.

source: You forgot your sketchbook
tr: Sketchbook'u unuttum

source: Arduino cannot run because it could not create a folder to store your sketchbook.
tr: Arduino yürütülemedi çünkü Sketchbook saklamak için klasör oluþturulamadý.

source: Select (or create new) folder for sketches...
tr: Sketchler için klasör seçin (veya yeni oluþturun)...

source: Problem Opening URL
tr: URL Açma Sorunu

source: Could not open the URL {0}
tr: URL açýlamadý {0}

source: Problem Opening Folder
tr: Klasör Açma Sorunu

source: Could not open the folder {0}
tr: Klasör açýlamadý {0}

source: environment
tr: ortam

source: Message
tr: Mesaj

source: Warning
tr: Uyarý

source: Could not remove old version of {0}
tr: Eski versiyonu kaldýrýlamadý {0}

source: Could not replace {0}
tr: Deðiþtirilemiyor {0}

source: Could not delete {0}
tr: Silinemiyor {0}

source: New Tab
tr: Yeni Sekme

source: Rename
tr: Yeniden adlandýr

source: Previous Tab
tr: Önceki Sekme

source: Next Tab
tr: Sonraki Sekme

source: Verify
tr: Dogrula

source: Open
tr: Aç

source: New Editor Window
tr: Yeni Editör Penceresi

source: Open in Another Window
tr: Yeni Pencerede Aç

source: No launcher available
tr: Baþlatýcý bulunamadý

source: Unspecified platform, no launcher available. To enable opening URLs or folders, add a "launcher=/path/to/app" line to preferences.txt
tr: Tanýmlanmamýþ platform,baþlatýcý bulunamadý. Açýlýþ URL'ler veya klasörleri etkinleþtirmek için,ekle "launcher=/path/to/app" preferences.txt doðrultusunda

source: Could not read color theme settings. You'll need to reinstall Processing.
tr: Renk temasý ayarlarý okunamadý.Processing'i yeniden yüklemeniz gerekiyor.

source: Browse
tr: Göz At

source: System Default
tr: Varsayýlan Sistem

source: Arabic
tr: Arapça

source: Catalan
tr: Katalanca

source: Chinese Simplified
tr: Basitleþtirilmiþ Çince

source: Chinese Traditional
tr: Geleneksel Çince

source: Danish
tr: Danimarkaca

source: Dutch
tr: Hollandaca

source: English
tr: Ýngilizce

source: Estonian
tr: Estonyaca

source: Filipino
tr: Filipince

source: French
tr: Fransýzca

source: Galician
tr: Galiçyaca

source: German
tr: Almanca

source: Greek
tr: Yunanca

source: Hindi
tr: Hintçe

source: Hungarian
tr: Macarca

source: Indonesian
tr: Endonezyaca

source: Italian
tr: Ýtalyanca

source: Japanese
tr: Japonca

source: Korean
tr: Korece

source: Latvian
tr: Letonyaca

source: Lithuaninan
tr: Litvanyaca

source: Marathi
tr: Marathice

source: Norwegian
tr: Norveçce

source: Persian
tr: Farsça

source: Polish
tr: Lehçe

source: Portuguese
tr: Portekizce

source: Romanian
tr: Romence

source: Russian
tr: Rusça

source: Spanish
tr: Ýspanyolca

source: Could not read default settings. You'll need to reinstall Arduino.
tr: Varsayýlan ayarlarý okuyamadý. Arduino'yu yeniden yüklemeniz gerekiyor.

source: Could not read preferences from {0}
tr: Tercihleri okuyamadý {0}

source: Error reading preferences
tr: Tercihleri okuma hatasý

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
tr: Tercihler dosyasýný okuma hatasý. Lütfen silin (veya taþýyýn) {0} ve Arduino'yu yeniden baþlatýn.

source: Sketchbook location:
tr: Sketchbook konumu:

source: Select new sketchbook location
tr: Yeni bir sketchbook konumu þeçin

source: Editor language:
tr: Editör Dili:

source: (requires restart of Arduino)
tr: ( Arduino'nun yeniden baþlatýlmasý gerekiyor)

source: Editor font size:
tr: Editör yazý tipi boyutu:

source: Show verbose output during:
tr: Mostrar resultado detallado durante:

source: compilation
tr: derleme

source: upload
tr: yükle

source: Verify code after upload
tr: Yüklemeden sonra kodu doðrulayýn

source: Use external editor
tr: Harici Editör kullan

source: Check for updates on startup
tr: Baþlangýçtaki güncellemeleri kontrol et

source: Update sketch files to new extension on save (.pde -> .ino)
tr: Kaydederken sketch dosyalarýný yeni uzantýyla güncelle (.pde -> .ino)

source: Automatically associate .ino files with Arduino
tr: .ino dosyalarýný Arduino'yla otomatik iliþkilendir

source: More preferences can be edited directly in the file
tr: Daha fazla tercihlerinizi dogrudan dosya içinde düzenleyebilirsiniz

source: (edit only when Arduino is not running)
tr: (sadece Arduino çalýþmazken düzenle)

source: ignoring invalid font size {0}
tr: geçersiz yazý tipi boyutunu görmezden gel {0}
