Repository: nazrdogan/IDE_translations
Catalog: Resources_*.po
Languages: tr

source: No files were added to the sketch.
tr: Sketch'e hiçbir dosya eklenmedi.

source: One file added to the sketch.
tr: Sketch'e bir dosya eklendi.

source: {0} files added to the sketch.
tr: Sketch'e {0} dosya eklendi .

source: File
tr: Dosya

source: New
tr: Yeni

source: Open...
tr: Aç...

source: Examples
tr: Örnekler

source: Close
tr: Kapat

source: Save
tr: Kaydet

source: Save As...
tr: Farklý Kaydet...

source: Upload
tr: Yükle

source: Upload Using Programmer
tr: Programcýyý kullanarak yükle

source: Page Setup
tr: Sayfa Düzeni

source: Print
tr: Yazdýr

source: Preferences
tr: Tercihler

source: Quit
tr: Çýkýþ

source: Verify / Compile
tr: Denetle / Derle

source: Import Library...
tr: Kütüphane Ekle...

source: Show Sketch Folder
tr: Sketch Klasörünü Göster

source: Add File...
tr: Dosya ekle...

source: Tools
tr: Araçlar

source: Serial Monitor
tr: Seri Monitör

source: Serial Port
tr: Seri Port

source: Programmer
tr: Programcý

source: Burn Bootloader
tr: Bootloader yükle

source: serialMenu is null
tr: serialMenu boþ

source: name is null
tr: isim boþ

source: error retrieving port list
tr: Port listesi alýnýrken hata

source: Help
tr: Yardým

source: Getting Started
tr: Baþlarken

source: Environment
tr: Ortam

source: Troubleshooting
tr: Sorun giderme

source: Reference
tr: Referans

source: Find in Reference
tr: Referansda bul

source: Frequently Asked Questions
tr: Sýkça Sorulan Sorular

source: Visit Arduino.cc
tr: Arduino.cc'ye git

source: About Arduino
tr: Arduino Hakkýnda

source: Edit
tr: Düzenle

source: Undo
tr: Geri

source: Redo
tr: Ýleri

source: Cut
tr: Kes

source: Copy
tr: Kopyala

source: Copy for Forum
tr: Forum için Kopyala

source: Copy as HTML
tr: HTML olarak Kopyala

source: Paste
tr: Yapýþtýr

source: Select All
tr: Hepsini Seç

source: Comment/Uncomment
tr: Yorum haline getir/Kod haline getir

source: Increase Indent
tr: Marjini artýr

source: Decrease Indent
tr: Marjini azalt

source: Find...
tr: Bul...

source: Find Next
tr: Ýleridekini Bul

source: Find Previous
tr: Geridekini Bul

source: Use Selection For Find
tr: Bulmak için Seçimi Kullan

source: First select a word to find in the reference.
tr: Referans içinde bulmak için ilk önce bir kelime seçin.

source: No reference available for "{0}"
tr: Referans mevcut deðil "{0}"

source: Compiling sketch...
tr: Sketch derleniyor...

source: Done compiling.
tr: Derlendi

source: Save changes to "{0}"?
tr: ¿Degiþiklikleri kaydetmek istiyormusunuz"{0}"?

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
tr: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Sketch'teki degiþiklikleri kaydetmek istiyormusunuz<BR>kapatmadan önce?</b><p>Eger kaydetmezsen,deðiþiklerin kaybolacaktýr.

source: Cancel
tr: Ýptal

source: Don't Save
tr: Kaydetme

source: Bad file selected
tr: Bozuk dosya seçildi

source: Processing can only open its own sketches and other files ending in .ino or .pde
tr: Processing sadece kendi Sketch'lerini ve .ino veya .pde uzantýlarýný açabilir.

source: OK
tr: Tamam

source: The file "{0}" needs to be inside a sketch folder named "{1}". Create this folder, move the file, and continue?
tr: Bu dosyanýn"{0}" Sketch klaslörü isimli içinde olmasý gerekiyor"{1}". Bu klasörü oluþtur,dosyayý taþýmak ve devam etmek istermisiniz?

source: Moving
tr: Taþýnýyor

source: Error
tr: Hata

source: A folder named "{0}" already exists. Can't open sketch.
tr: Bir dosya adý"{0}" zaten mevcut. Sketch açýlamadý.

source: Could not create the sketch folder.
tr: Sketch klasörü oluþturulamadý.

source: Could not copy to a proper location.
tr: Uygun yere kopyalanamadý.

source: Could not create the sketch.
tr: Sketch oluþturulamadý.

source: Saving...
tr: Kaydediliyor...

source: Done Saving.
tr: Kaydedildi.

source: Save Canceled.
tr: Kaydetme iptal edildi.

source: Serial port {0} not found. Retry the upload with another serial port?
tr: Seri Port bulunamadý Baþka bir seri porttan yüklemeyi denemek istermisiniz?

source: Uploading to I/O Board...
tr: G/Ç Board'una yükleniyor...

source: Done uploading.
tr: Yüklendi.

source: Upload canceled.
tr: Yükleme iptal edildi.

source: Save changes before export?
tr: Dýþa aktarmadan degiþikliklerý kaydedilsin mi?

source: Export canceled, changes must first be saved.
tr: Dýþa aktarým iptal edildi.Degiþiklikler öncce kaydedilmiþ olmalýdýr.

source: Burning bootloader to I/O Board (this may take a minute)...
tr: G/Ç Board'una bootloader yükleniyor( bu birkaç dakika alabilir)

source: Done burning bootloader.
tr: Bootloader yüklendi.

source: Error while burning bootloader.
tr: Bootloader yüklenirken hata oluþtu.

source: Printing...
tr: Yazdýrýlýyor...

source: Done printing.
tr: Yazdýrýldý.

source: Error while printing.
tr: Yazdýrýrken hata.

source: Printing canceled.
tr: Yazdýrma iptal edildi.

source: Bad error line: {0}
tr: Kötü Hata Satýrý: {0}

source: Open URL
tr: URL aç

source: A new version of Arduino is available, would you like to visit the Arduino download page?
tr: Arduino yeni sürümü mevcut, Arduino indirme sayfasýný ziyaret etmek istermisiniz?

source: Yes
tr: Evet

source: No
tr: Hayýr

source: Update
tr: Güncelle

source: Find:
tr: Bul:

source: Replace with:
tr: ile deðiþtirin:

source: Ignore Case
tr: Küçük büyük harf ayrýmýný yoksay

source: Wrap Around
tr: Etrafýný Sarýn

source: Replace All
tr: Hepsini Deðiþtir

source: Replace
tr: Deðiþtir

source: Replace & Find
tr: Degiþtir ve Bul

source: Previous
tr: Önceki

source: Find
tr: Bul

source: Send
tr: Gönder

source: Autoscroll
tr: Otomatik Kaydýrma

source: No line ending
tr: Koddakini gönder

source: Newline
tr: Yeni Satýr

source: Carriage return
tr: Satýrbaþý

source: Both NL & CR
tr: hem NL hem CR

source: Serial port ''{0}'' already in use. Try quitting any programs that may be using it.
tr: Seri port ''{0}'' zaten kullanýmda . kullanýyor olabileceðin programlardan çýkmayý deneyin.

source: Error touching serial port ''{0}''.
tr: Serial port baðlantý hatasý ''{0}''.

source: Serial port ''{0}'' already in use. Try quiting any programs that may be using it.
tr: Seri port ''{0}'' zaten kullanýmda . kullanýyor olabileceðin programlardan çýkmayý deneyin.

source: Error opening serial port ''{0}''.
tr: Seri port açýlýrken hata ''{0}''.

source: Serial port ''{0}'' not found. Did you select the right one from the Tools > Serial Port menu?
tr: Seri port ''{0}'' bulunamadý. ¿Araçlardan doðru bir tane þeçtiniz mi> Seri port menü?

source: readBytesUntil() byte buffer is too small for the {0} bytes up to and including char {1}
tr: readBytesUntil () bayt arabellek yukarý ve {0} bayt için çok küçükchar dahil {1}

source: Error inside Serial.{0}()
tr: Seri.{0} iletiþim içinde hata()

source: Auto Format
tr: Otomatik Format

source: No changes necessary for Auto Format.
tr: Otomatik Format için gerekli deðiþiklik yok.

source: Auto Format Canceled: Too many right parentheses.
tr: Otomatik Format iptal edildi:Çok Fazla sað parantez mevcut.

source: Auto Format Canceled: Too many left parentheses.
tr: Otomatik Format iptal edildi:Çok Fazla sol parantez mevcut.

source: Auto Format Canceled: Too many right curly braces.
tr: Otomatik Format iptal edildi:Çok Fazla saðda köþeli parantez mevcut.

source: Auto Format Canceled: Too many left curly braces.
tr: Otomatik Format iptal edildi:Çok Fazla solda köþeli parantez mevcut.

source: Auto Format finished.
tr: Otomatik Format bitti.

source: Fix Encoding & Reload
tr: Kodlama Düzeltme ve Yeniden Yükleme

source: Discard all changes and reload sketch?
tr: Tüm degiþiklikleri iptal et ve Sketch'i yeniden yüklensin mi?

source: An error occurred while trying to fix the file encoding. Do not attempt to save this sketch as it may overwrite the old version. Use Open to re-open the sketch and try again.
tr: Dosya kodlama düzeltmek için çalýþýrken bir hata oluþtu Eski sürümü bunun üzerine yazabilir bu sketch kaydetmek için çalýþmayýn.Sketch'i yeniden açmayý kullanýn ve yeniden deneyin

source: Archive Sketch
tr: Sketch'i Arþivle

source: yyMMdd
tr: yyAAgg

source: Couldn't archive sketch
tr: Sketch Arþivlenemedi

source: Archiving the sketch has been canceled because the sketch couldn't save properly.
tr: Sketch arþivlenmesi iptal edildi.Çünkü Sketch uygun bir þekilde kaydedilemedi.

source: Archive sketch as:
tr: Sketch olarak Arþivle:

source: Archive sketch canceled.
tr: Arþiv sketch iptal edildi.

source: Error while loading code {0}
tr: Kod yüklenirken hata{0}

source: "{0}" contains unrecognized characters.If this code was created with an older version of Processing,you may need to use Tools -> Fix Encoding & Reload to update the sketch to use UTF-8 encoding. If not, you may need todelete the bad characters to get rid of this warning.
tr: "{0}"Tanýnmayan karakterler içeriyor.Eger bu kod Processing'in eski bir sürümü ile oluþturulduysa ,Araçlarý kullanmanýz gerekebilir ->Kodlama düzeltmeUTF-8 kodlamasý kullanmak için sketch güncelleþtirmenizi saðlarEger deðilse,bu uyarýdan kurtulmak için kötü karakterleri silmek gerekebilir.

source: Sketch is Read-Only
tr: Skecth sadece okunabilir

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
tr: Bazý dosyalar "sadece okunabilir", olarak iþaretlendi.Baþka bir konumda sketch'i yeniden kaydetmeniz, e gerekecek.

source: Name for new file:
tr: Yeni dosya için isim:

source: Sketch is Untitled
tr: Sketch baþlýksýz

source: How about saving the sketch first before trying to rename it?
tr: Sketch'i yeniden adlandýrmayý denemeden önce kaydetmeye ne dersin?

source: Problem with rename
tr: Yeniden adlandýrmada hata

source: The name cannot start with a period.
tr: Ýsim noktayla baþlayamaz.

source: ".{0}" is not a valid extension.
tr: ".{0}" geçerli bir uzantý deðil.

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
tr: Main dosyasýný uzantý olarak kullanýlamaz. (Senin mezuniyet zamaýný olabilir "gerçek " bir programlama ortamý)

source: Nope
tr: Hayýr

source: A file named "{0}" already exists in "{1}"
tr: "{0} adlý bir dosya zaten mevcut"{1}"

source: You can't have a .cpp file with the same name as the sketch.
tr: Sketch'le ayný isimde .cpp dosyasýna sahip olamazsýn.

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
tr: Sketch adlandýrýlamýyor"{0}" Çünkü Sketch'le ayný isimde bir .cpp dosyasý zaten mevcut.

source: Cannot Rename
tr: Yeniden adlandýrýlamadý

source: Sorry, a sketch (or folder) named "{0}" already exists.
tr: Üzgünüm, bir sketch(veya klasör) zaten mevcut. "{0}".

source: Could not rename the sketch. (0)
tr: Sketch yeniden adlandýrýlamadý. (0)

source: Could not rename "{0}" to "{1}"
tr: Yeniden adlandýrýlamadý"{0}" e doðru "{1}"

source: Could not rename the sketch. (1)
tr: Sketch yeniden adlandýrýlamadý. (1)

source: Could not rename the sketch. (2)
tr: Sketch yeniden adlandýrýlamadý. (2)

source: createNewFile() returned false
tr: createNewFile() yanlýþ döndü

source: Are you sure you want to delete this sketch?
tr: Sketch'i silmek istediðinizden eminmisiniz?

source: Are you sure you want to delete "{0}"?
tr: Bu Sketch silmek istediðinizden eminmisiniz"{0}"?

source: Delete
tr: Sil

source: Couldn't do it
tr: Bunu yapamam

source: Could not delete "{0}".
tr: Silinemedi"{0}".

source: removeCode: internal error.. could not find code
tr: removeCode: iç hata... Kod bulunamadý

source: Sketch is read-only
tr: Skecth sadece okunabilir

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
tr: Bazý dosyalar"sadece okunabilir "olarak iþaretlenmiþ, baþka bir yerde Sketch yeniden kaydetmeniz gerekecek.

source: In Arduino 1.0, the default file extension has changed from .pde to .ino. New sketches (including those created by "Save-As" will use the new extension. The extension of existing sketches will be updated on save, but you can disable this in the Preferences dialog. Save sketch and update its extension?
tr: Arduino 1.0'da ,varsayýlan dosya uzantýsý .pde den .ino olarak degiþtirildi. yeni sketchler( "Farklý kaydet" tarafundan oluþturulan yeni uzantýlarý kullanacak. ,Sketchlerin uzantýlarý kayýtta güncellenecek ama sen Tercihler dialogundan devre dýþý býrakibilirsin. Sketch'i kaydedip ve uzantýsýný güncellermisin?

source: Save sketch folder as...
tr: Sketch klasör olarak kaydet...

source: You can't save the sketch as "{0}" because the sketch already has a .cpp file with that name.
tr: Sketch olarak kaydedemezsiniz"{0}" Çünkü bu sketch isminde bir .cpp dosyasý mevcut.

source: How very Borges of you
tr: Bu gerçekten inanýlmaz bir þey

source: You cannot save the sketch into a folder inside itself. This would go on forever.
tr: Bu klasörün kendi içinde sketch klasörü kaydedemezsin Bu sonsuza kadar devam edecek.

source: Select an image or other data file to copy to your sketch
tr: Sketch'ine kopyalamak için görüntü veya diðer veri dosyasý seçin

source: Replace the existing version of {0}?
tr: {0} olan sürümü deðiþtirin ?

source: Error adding file
tr: Dosya eklerken Hata

source: Could not delete the existing ''{0}'' file.
tr: Varolan dosya silinemedi''{0}''.

source: You can't fool me
tr: Beni kandýramazsýn

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
tr: Bu dosya zaten eklemeye çalýþtýgýn yere kopyalanmýþ. Ben seni sadece görmezden geliyorum.

source: Could not add ''{0}'' to the sketch.
tr: Sketch'e ''{0}'' eklenemedi.

source: Build folder disappeared or could not be written
tr: Oluþturma klasörü kayboldu veya yazýlamadý.

source: Could not find main class
tr: main sýnýfý bulunamadý

source: Uncaught exception type: {0}
tr: Yakalanmamýþ istisna tipi: {0}

source: Problem moving {0} to the build folder
tr: Kurulum klasörü {0} taþýrken hata oluþtu.

source: Uploading...
tr: Yükleniyor...

source: Binary sketch size: {0} bytes (of a {1} byte maximum)
tr: Binary sketch boyutu: {0} bayr ( {1} maksimum bayt boyutu)

source: Couldn't determine program size: {0}
tr: Program boyutu belirlenemiyor: {0}

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
tr: Sketch fazla büyük; bkz http://www.arduino.cc/en/Guide/Troubleshooting#boyutlarýn azaltýlmasý ile ilgili ipucu için.

source: Missing the */ from the end of a /* comment */
tr: Açýklama */ sonunda/* eksik */

source: Sketch Disappeared
tr: Sketch kayboldu

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
tr: Sketch klasörü kayboldu. Ayný konumda yeniden kaydetmek istermisiniz, ama bunun yanýnda kodda kaybolacaktýr.

source: Could not re-save sketch
tr: Sketch yeniden kaydedilemedi

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
tr: Sketch uygun þekilde yeniden kaydedilemedi. Bu noktada sorun olabilir ve baþka bir metin editörü için kodunuzu kopyalayýp yapýþtýrmak için zamaný gelmiþ olabilir.

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less less than 64 characters long.
tr: Sketch ismi deðiþtirilmiþ olmasý gerekiyordu. Sketch isimleri sadece ASCII karakterlerini ve sayýlarý içerir(ama isimle baþlayamaz ).64 karakter uzunlugundan çok çok az olmalýdýr.

source: Forcing reset using 1200bps open/close on port
tr: 1200bps açýk/kapalý port üzerinde zorla reset kullanýlýyor

source: Couldn’t find a Leonardo on the selected port. Check that you have the correct port selected. If it is correct, try pressing the board's reset button after initiating the upload.
tr: Seçilmiþ portun üzerinde Leonardo bulunamadý. Dogru portun seçilmiþ olduðunu kontrol edin.Eger doðruysa ,Board'un resetine basýnyüklemeye baþlayacaktýr

source: Compiler error, please submit this code to {0}
tr: Derleme hatasý,Lütfen bu kodu gönderin {0}

source: the selected serial port {0} does not exist or your board is not connected
tr: seçilen port mevcut deðil{0} veya Board'una baglý degil.

source: Device is not responding, check the right serial port is selected or RESET the board right before exporting
tr: Aygýt yanýt vermiyor, Dogru serial port oldugunu kontrol edin veya RESET'leyin

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
tr: Board'a yüklerken sorun oluþtu. bkz http://www.arduino.cc/en/Guide/Sorun giderme#öneriler için yükleme

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
tr: Yanlýþ mikrokontrolör bulundu.Araçlardan doðru board'u þeçtiniz mi? >Board menü

source: No board selected; please choose a board from the Tools > Board menu.
tr: Hiçbir board seçilmedi; Lütfen Araçlardan bir board seçin >Board menü

source: {0} returned {1}
tr: {0} döndürüldü {1}

source: Error compiling.
tr: Derleme Hatasý.

source: Please import the SPI library from the Sketch > Import Library menu.
tr: Lütfen Sketch'ten SPI kütüphanesini içe aktarýn > Kütüphane Ýçe aktarým menü.

source: As of Arduino 0019, the Ethernet library depends on the SPI library. You appear to be using it or another library that depends on the SPI library.
tr: Arduino 0019 itibariyle,Ethernet kütüphanesi SPI kütüphanesine baðlýdýr . Ya Bunu kullanýyor gözüküyorsun veya SPI kütüphanesine baðlý bir baþka bir kütüphanekullanýyorsun

source: The 'BYTE' keyword is no longer supported.
tr: 'BYTE'anathar kelimesi artýk desteklenmiyor.

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
tr: Arduino 1.0 itibariyle, 'BYTE'anathar kelimesi artýk desteklenmiyor Lütfen yerine Serial.write() kullanýn.

source: The Server class has been renamed EthernetServer.
tr: Server , EthernetServer olarak yeniden adlandýrýldý.

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
tr: Arduino 1.0 itibariyle, Ethernet kütüphanesindeki Server sýnýfý EthernetServer olarak yeniden adlandýrýldý

source: The Client class has been renamed EthernetClient.
tr: Client sýnýfý EthernetClient olarak adlandýrýldý.

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
tr: Arduino 1.0 itibariyle,Ethernet kütüphanesindeki Client sýnýfý EthernetClient olarak yeniden adlandýrýldý.

source: The Udp class has been renamed EthernetUdp.
tr: Arduino 1.0 itibariyle, Ethernet kütüphanesindeki Udp sýnýfý EthernetUdp olarak adlandýrýldý.

source: Wire.send() has been renamed Wire.write().
tr: Wire.send() Wire.write() olarak yeniden adlandýrýldý.

source: As of Arduino 1.0, the Wire.send() function was renamed to Wire.write() for consistency with other libraries.
tr: Arduino 1.0 itibariyle, Wire.send() diðer kütüphanelerle tutarlýlýk göstermek için Wire.write() olarak adlandýrýldý.

source: Wire.receive() has been renamed Wire.read().
tr: Wire.receive() Wire.read() olarak yeniden adlandýrýldý.

source: As of Arduino 1.0, the Wire.receive() function was renamed to Wire.read() for consistency with other libraries.
tr: Arduino 1.0 itibariyle, Wire.receive(), diðer kütüphanelerle tutarlýlýk göstermek için Wire.read() olarak degiþtirildi.

source: 'Mouse' only supported on the Arduino Leonardo
tr: 'Mouse' sadece Arduino Leonardo'da destekleniyor.

source: 'Keyboard' only supported on the Arduino Leonardo
tr: 'Keyboard' sadece Arduino Leonardo'da destekleniyor.

source: Console Error
tr: Konsol Hatasý

source: A problem occurred while trying to open the files used to store the console output.
tr: Konsol çýktýsýný depolamak için kullanýlan dosyalarý açmak için çalýþýrken bir sorun oluþtu.

source: Non-fatal error while setting the Look & Feel.
tr: Görünüm ayarlarýný ayarlerken hata oluþtu.

source: The error message follows, however Arduino should run fine.
tr: Hata mesajý var ama yinede Arduino düzgün çalýþýyor olmalý

source: Problem Setting the Platform
tr: Platform Ayarlarý Hatasý

source: An unknown error occurred while trying to load platform-specific code for your machine.
tr: Makinene platforma özel kodu yüklemeye çalýþýrken bilinmeyen bir hata oluþtu.

source: Please install JDK 1.5 or later
tr: Lütfen JDK 1.5 veya sonraki bir sürümünü yükleyin

source: Arduino requires a full JDK (not just a JRE) to run. Please install JDK 1.5 or later. More information can be found in the reference.
tr: Arduino çalýþmasý için tam sürüm JDK gerekiyor(sadece JRE deðil) Lütfen JDK 1.5 veya daha sonraki bir sürümü yükleyin. Daha fazla bilgi referanslarda bulunabilir.

source: Sketchbook folder disappeared
tr: Sketchbook klasörü kayboldu

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
tr: Sketchbook klasörü mevcut degil. Arduino varsayýlan sketchbook konumuna dönecek, eger gerekliyse yeni bir sketchbook klasörü oluþturacak Sonra Arduino kendisi hakkýnda üçünçü kiþilerle konuþmayý kesecek.

source: Time for a Break
tr: Ara verme zamaný

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
tr: Bugün için yeni otomatik sketch adlandýrma limitine ulaþtýn Bunun yerine yürüyüþe çýkmaya ne dersin?

source: Sunshine
tr: Günýþýðý

source: No really, time for some fresh air for you.
tr: Ciddi olamazsýn,Temiz hava alma zamaný senin için.

source: Open an Arduino sketch...
tr: Arduino Sketch'ini Aç...

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Are you sure you want to Quit?</b><p>Closing the last open sketch will quit Arduino.
tr: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>¿Estás Çýkmak istediðinizden eminmsiniz?</b><p>Arduino son açýk sketch kapatýltýktan sonra çýkýþ yapacak

source: Contributed
tr: Katkýda Bulundu

source: Sketch Does Not Exist
tr: Sketch mevcut deðil

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
tr: Seçilmiþ Sketch artýk yok. sketchbook menüyü güncellemek için Arduino. yeniden baþlatmanýz gerekebilir.

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
tr: El Sketch "{0}" kullanýlamýyor. Sketch ismi temel harfler ve numaralarý içermelidir (Sadece- ASCII boþluksuz,ve numaralarla baþlayamaz ). Bu mesajdan kurtulmak için, Sketch'i {1} burdan taþýyýn

source: Ignoring sketch with bad name
tr: Bozuk isimli sketch yoksayýlýyor

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
tr: Kütüphane "{0}" kullanýlamýyor. Kütüphane ismi temel harfler ve numaralarý içermelidir (Sadece- ASCII boþluksuz,ve numaralarla baþlayamaz ).

source: Ignoring bad library name
tr: Bozuk kütüphane ismi yoksayýlýyor

source: Problem getting data folder
tr: Veri klasörü alýnýrken sorun oluþtu

source: Error getting the Arduino data folder.
tr: Arduino veri klasörü alýnýrken Hata oluþtu.
